testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     QmomKinetics;

startFrom       startTime;

startTime     0;

stopAt          endTime;

endTime         50;

deltaT          0.05;

//writeControl    timeStep;
writeControl    adjustableRunTime;
/*
  adjustableRunTime
  clockTime
  cpuTime
  runTime
  timeStep
*/
//writeInterval   100;
writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

maxAlphaCo      0.1;
maxDeltaT       0.05;

functions
{
       volAverage
       {
               type                    cellSource;
               functionObjectLibs ("libfieldFunctionObjects.so");
               log                     true;
               valueOutput             false;
               source                  all;
               operation               volAverage;
               outputControl           outputTime;
               outputInterval 1;
               fields
               (
                  alpha.gas
                  mZero
                  mOne
                  rho_foam
                  rho
               );
        }
}
