testCase/0/Tfoam
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tfoam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    Wall
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
axis1
	{
		type    symmetryPlane;
	}
axis2
	{
		type    symmetryPlane;
	}
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
